/**
 * Created by khan on 10.03.16. MaxNum
 */
public class Element<T> {
//    // Создаёт новый элемент со значением x
//    public Element(T x)
//    {
//        // ...
//    }
//
//    // Возвращает значение элемента
//    public T x()
//    {
//        // ...
//    }
//
//    // Определяет, принадлежит ли текущий элемент
//    // тому же множеству, что и элемент elem
//    public boolean equivalent(Element<T> elem)
//    {
//        // ...
//    }
//
//    // Объединяет множество, которому принадлежит текущий
//    // элемент, с множеством, которому принадлежит
//    // элемент elem
//    public void union(Element<T> elem)
//    {
//        // ...
//    }
}